Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh95-v4.tmx
Source language: bo
Languages: en

source: །ཚིག་དེ་ཐོས་ནས་རྒྱལ་ཆེན་བཞིའི་རིས་ཀྱི་ལྷ་འབུམ་ཕྲག་བརྒྱད་ཅུ་རྩ་བཞི་དང་། སུམ་ཅུ་རྩ་གསུམ་གྱི་ལྷ་འབུམ་དང་། འཐབ་བྲལ་གྱི་ལྷ་འབུམ་དང་། དགའ་ལྡན་གྱི་ལྷ་འབུམ་དང་། འཕྲུལ་དགའི་ལྷ་འབུམ་དང་། བདུད་ཀྱི་རིས་ཀྱི་ལྷ་སྔོན་གྱི་དགེ་བའི་ལས་ཀྱིས་བྱུང་བ་དྲུག་ཁྲི་དང་། ཚངས་རིས་ཀྱི་ལྷ་དྲུག་ཁྲི་བརྒྱད་སྟོང་དང་། འོག་མིན་གྱི་བར་གྱི་ལྷ་བརྒྱ་སྟོང་མང་པོ་དག་འདུས་པར་གྱུར་པ་དང་། གཞན་ཡང་ཤར་ཕྱོགས་དང་། ལྷོ་ཕྱོགས་དང་། ནུབ་ཕྱོགས་དང་། བྱང་ཕྱོགས་ནས་ལྷའི་བུ་བརྒྱ་སྟོང་མང་པོ་འདུས་པར་གྱུར་པ་དེ་དག་ལས་གང་དག་མཆོག་ཏུ་བྱ་བའི་ལྷའི་བུ་དག་གིས་ལྷའི་འཁོར་ཆེན་པོ་དེ་དག་ལ་ཚིགས་སུ་བཅད་པ་འདི་དག་སྨྲས་སོ།
en: When they heard these verses, the gods assembled. There were 84,000 gods from the Heaven of the Four Great Kings, 100,000 gods from the Heaven of the Thirty-Three, 100,000 gods from the Heaven Free from Strife, 100,000 gods from the Heaven of Joy, 100,000 gods from the Heaven of Delighting in Emanations, 100,000 gods from the Heaven of Making Use of Others’ Emanations, 60,000 gods from the realm of Māra who were born there because of their former virtuous actions, 68,000 gods from the realm of Brahmā, and many hundreds of thousands of gods assembled from all the realms up to the highest heaven. Moreover, many hundreds of thousands of gods came together from the east, the south, the west, and the north. The foremost among the gods then spoke these verses to the great assembly of gods:

source: །བདག་ཅག་རྣམས་ཀྱིས་བསམ་པ་ཡང་དག་ཅི་འདྲ་ཡི། །ཚིག་འདི་ལྷ་ཡི་དབང་པོ་དག་གིས་གསན་དུ་གསོལ།
en: “Immortal lords, please listen to these words That express what is on our minds!

source: །འདོད་པའི་དགའ་འབྱོར་བསམ་གཏན་བདེ་བ་མཆོག་སྤངས་ཏེ།
en: We give up our sensual enjoyments and the perfect bliss of concentration

source: །སེམས་ཅན་དག་པ་དམ་པ་འདི་ཡི་ཞབས་འབྲིང་བགྱི།
en: In order to serve this sublime pure being.

source: །ལྷུམས་སུ་གཤེགས་དང་ལྷུམས་ན་བཞུགས་དང་བལྟམ་པའི་ཚེ།
en: “As he enters the womb, abides in the womb, and is born,

source: །བདག་ཉིད་ཆེན་པོ་མཆོད་འོས་ཤིན་ཏུ་མཆོད་པར་བགྱི།
en: We will make offerings to the Great Being, so worthy of worship.

source: །བསོད་ནམས་དག་གིས་བསྲུངས་པའི་དྲང་སྲོང་ཡོངས་བསྲུངས་ན།
en: We shall protect the Sage, who is well guarded by merit;

source: །ཞེ་སྡང་སེམས་ཀྱིས་སུས་ཀྱང་གླགས་རྙེད་འགྱུར་མ་མཆིས།
en: No one shall cause him any problems through a hostile mind.

source: །གླུ་དབྱངས་སིལ་སྙན་རོལ་མོའི་དབྱངས་སྒྲ་ལེགས་བསྒྲགས་པས།
en: “In songs and with the melodious sounds of cymbals,

source: །ཡོན་ཏན་རྒྱ་མཚོ་མངའ་བའི་ཡོན་ཏན་བསྔགས་བརྗོད་དེ།
en: We will praise the qualities of the one with an ocean of qualities.

source: །གང་ཐོས་སྐྱེ་བོ་བྱང་ཆུབ་མཆོག་ཏུ་སེམས་བསྐྱེད་པར།
en: Whoever hears this will engender the excellent mind of awakening

source: །ལྷ་དང་མི་རྣམས་ཐམས་ཅད་རབ་ཏུ་དགའ་བར་བགྱི།
en: And thus delight all gods and humans.

source: །རྒྱལ་པོའི་ཕོ་བྲང་མེ་ཏོག་སིལ་མས་རྒྱས་པར་དགང་། །ཨ་ག་རུ་མཆོག་ནག་པོས་བདུགས་ཏེ་དྲི་ཞིམ་བགྱི།
en: “We shall fill the king’s palace with flower petals And light the finest incense of black aloe.

source: །དེ་ཡི་དྲི་ཚོར་ལྷ་མི་རབ་ཏུ་དགའ་འགྱུར་ཞིང་།
en: With that aroma, gods and humans will become very content;

source: །ནད་མེད་རིམས་ནད་བྲལ་ཞིང་བདེ་བར་འགྱུར་བར་བགྱི།
en: It will free them from sickness and fever and make them happy.

source: །མེ་ཏོག་མན་དཱ་ར་དང་ཀུན་ནས་འདུ་བ་དང་། །སིམ་བྱེད་རབ་ཏུ་སིམ་བྱེད་སྠ་ལ་རྣམ་སྣང་དང་། །མེ་ཏོག་བཟང་པོས་ཕྲིན་ལས་དགེ་ལས་བྱུང་བ་དེ། །མཆོད་པའི་སླད་དུ་སེར་སྐྱའི་གྲོང་ཀུན་དགང་བར་བགྱི།
en: “We will fill the entire city of Kapilavastu With blossoms of māndārava flowers, beautiful jasmine, and hibiscus, In order to make offerings to him, Who appears due to virtuous activities.

source: །ཇི་སྲིད་ཡུམ་གྱི་ལྷུམས་ན་དྲི་གསུམ་མ་གོས་བཞུགས།
en: “As long as he is in his mother’s womb, untainted by the three stains,

source: །ཇི་སྲིད་རྒ་ཤི་མཐར་འབྱིན་བལྟམ་པར་གྱུར་གྱི་བར།
en: And until he is born in order to bring an end to aging and death,

source: །དེ་སྲིད་དུས་སུ་དང་བའི་ཡིད་ཀྱིས་ཞབས་འབྲིང་བགྱི།
en: We will serve him devotedly.

source: །བློ་གྲོས་ཆེ་མངའ་མཆོད་པ་བགྱི་བར་བདག་ཅག་སེམས།
en: Our wish is to make offerings to the great intelligent one.

source: །བལྟམ་ནས་གོམ་པ་བདུན་གཤེགས་བརྒྱ་བྱིན་ཚངས་པ་ཡིས། །ལག་ཏུ་བླངས་ཏེ་སྤོས་ཆུ་དག་གིས་སྐུ་བསིལ་བ། ། སེམས་ཅན་རྣམ་པར་དག་པ་དེ་ནི་མཐོང་བ་ཡི། །ལྷ་མི་དེ་དག་ཐོབ་པ་རྒྱ་ཆེན་ལེགས་པར་ཐོབ།
en: “It will be a great blessing for gods and humans To witness the newborn taking seven steps, To see him received by Śakra and Brahmā, And to see the Pure Being bathed with perfumed water.

source: །ཇི་སྲིད་བར་དུ་འཇིག་རྟེན་རྗེས་སུ་འཐུན་མཛད་ཅིང་།
en: “While he behaves in accord with the world,

source: །འདོད་པའི་ཉོན་མོངས་འཇོམས་མཛད་བཙུན་མོའི་ནང་བཞུགས་ལ།
en: And conquers the afflictions of desire inside the women’s quarters,

source: །ཇི་སྲིད་ཅིག་ན་རྒྱལ་སྲིད་ཀུན་སྤངས་ཁབ་ནས་འབྱུང་།
en: And as he abandons his entire kingdom,

source: །དེ་སྲིད་དུས་སུ་དད་པའི་སེམས་ཀྱིས་ཞབས་འབྲིང་བགྱི།
en: Throughout that time, we will serve him devotedly.

source: །ཇི་སྲིད་ཅིག་ན་རན་བསྣམས་བྱང་ཆུབ་སྙིང་པོར་གཤེགས།
en: “When he acquires grass and travels to the seat of awakening,

source: །ཇི་སྲིད་ཅིག་ན་བདུད་བཅོམ་བྱང་ཆུབ་རེག་གྱུར་ཅིང་།
en: And as he conquers the demons and gains awakening,

source: །ཚངས་པ་ཁྲག་ཁྲིག་འཁོར་ལོ་བསྐོར་བར་གསོལ་བཏབ་པ།
en: And is entreated to turn the wheel of the Dharma by a billion Brahmā gods,

source: །དེ་སྲིད་བདེ་བར་གཤེགས་ལ་མཆོད་པ་རྒྱ་ཆེན་བགྱི།
en: Throughout that time, we will make vast offerings to the Well-Gone One.

source: །སེམས་ཅན་བྱེ་བ་ཁྲག་ཁྲིག་འཆི་མེད་བཏུལ་གྱུར་ཏེ།
en: “While he tames trillions of beings for the deathless state,

source: །སྟོང་གསུམ་ཁམས་སུ་སངས་རྒྱས་ཕྲིན་ལས་ནམ་ལགས་ནས།
en: Performing enlightened activity in the trichiliocosm,

source: །ཞི་ཞིང་བསིལ་བའི་མྱ་ངན་འདས་པར་གཤེགས་གྱུར་པ།
en: And until he passes into cool and peaceful nirvāṇa,

source: །དེ་སྲིད་ཀུན་གྱིས་དྲང་སྲོང་གྲགས་ཆེན་གཏང་མི་བགྱི།
en: For that long, none of us will abandon the greatly renowned sage.”

source: །དགེ་སློང་དག་དེ་ནས་འདོད་པ་ན་སྤྱོད་པའི་ལྷའི་བུ་མོ་དག་གིས། བྱང་ཆུབ་སེམས་དཔའི་ལུས་གཟུགས་ཕུན་སུམ་ཚོགས་པ་མཐོང་ནས་འདི་སྙམ་དུ་སེམས་ཏེ། སེམས་ཅན་དག་པ་མཆོག་དམ་པ་འདི་ལྟ་བུ་འཛིན་པར་འགྱུར་བའི་ན་ཆུང་དེ་ནི་ཇི་ལྟ་བུ་ཞིག་ཡོད་སྙམ་ནས།
en: Monks, the goddesses who sport in the desire realms saw the perfection of the Bodhisattva’s bodily form and wondered, “What is she like, that maiden who will conceive this sublime and supreme pure being?”

source: དེ་དག་ངོ་མཚར་དུ་གྱུར་ཏེ། མེ་ཏོག་དང་། སྤོས་དང་། ཕྲེང་བ་དང་། བྱུག་པ་མཆོག་ཏུ་བྱ་བ་དག་ཁྱེར་ནས་ལྷའི་ལུས་ཡིད་ལས་གྲུབ་པ་ཐོབ་ཅིང་བསོད་ནམས་ཀྱི་རྣམ་པར་སྨིན་པའི་རྫུ་འཕྲུལ་གྱིས་བྱིན་གྱིས་བརླབས་པ།
en: Filled with curiosity, they gathered the finest and best flowers, incense, lamps, perfumes, garlands, ointments, powders, and cloths. Then, blessed as they were with supernatural powers from the ripening of merit and with divine bodies that are mentally created, they instantaneously disappeared from that celestial palace.

source: དེ་དག་སྐད་ཅིག་དེ་ཉིད་ལ་ལྷའི་ཕོ་བྲང་དེ་ནས་མི་སྣང་བར་གྱུར་ཏེ། སེར་སྐྱའི་གྲོང་ཁྱེར་ཆེན་པོ་དམ་པ་སྐྱེད་མོས་ཚལ་བརྒྱ་སྟོང་གིས་བརྒྱན་པ། རྒྱལ་པོ་ཟས་གཙང་མའི་ཁྱིམ་མཆོག་ཁང་བཟངས་ཆེན་པོ་དང་སྐྱ་ལྡན་ཞེས་བྱ་བ་ལྷའི་དབང་པོའི་ཕོ་བྲང་ལྟ་བུ་དེར་ཕྱིན་ནས།
en: By means of their celestial powers, they traveled to Kapilavastu, that sublime city with a hundred thousand gardens, and arrived at King Śuddhodana’s residence, known as the Home of the Swans, the great mansion that resembled the palaces of the ruler of the gods.

source: ལྷའི་བུ་མོ་གོས་ལྷུག་ལྷུག་པོ་གྱོན་པ། དགེ་བ་དྲི་མ་མེད་པའི་བསོད་ནམས་ཀྱི་གཟི་བརྗིད་ཀྱིས་རབ་ཏུ་བརྒྱན་པ།
en: The goddesses, wearing loose gowns, were well adorned by the splendor of their immaculate merit, and their arms and hands were full of divine ornaments.

source: ལྷའི་རྒྱན་གྱིས་ལག་པ་ཤིན་ཏུ་བརྒྱན་པ་དེ་དག་གིས་ལྷ་མོ་སྒྱུ་འཕྲུལ་མལ་མཆོག་གི་སྟེང་ན་འདུག་པ་མཐོང་ནས།
en: They saw Queen Māyā resting on her fine bed.

source: ཕན་ཚུན་མཛུབ་མོས་སྟོན་ཅིང་། ནམ་མཁའི་དཀྱིལ་ན་འཁོད་དེ། གཅིག་ལ་གཅིག་ཚིགས་སུ་བཅད་དེ་སྨྲས་པ།
en: They pointed her out to each other and, hovering in midsky, they sang these verses to one another:

source: ལྷ་གནས་འཁོད་པའི་ལྷ་ཡི་བུ་མོ་རྣམས།
en: “We goddesses who live in divine abodes

source: །ཡིད་འོང་བྱང་ཆུབ་སེམས་དཔའི་སྐུ་མཐོང་ནས།
en: Saw the attractive body of the Bodhisattva.

source: །དེ་ཚེ་དེ་དག་འདི་སྙམ་སེམས་གྱུར་ཏེ།
en: At that time we considered,

source: །བྱང་ཆུབ་སེམས་དཔའི་ཡུམ་གྱུར་ཅི་འདྲ་སྙམ། །ལག་ན་མེ་ཏོག་ཕྲེང་ཅན་དེ་དག་རྣམས།
en: ‘What will the mother of the Bodhisattva be like?’

source: །ཐེ་ཙོམ་སྐྱེས་ནས་རྒྱལ་པོའི་ཕོ་བྲང་དུ།
en: “Our curiosity aroused, we approached the royal palace

source: །མེ་ཏོག་དེ་བཞིན་བྱུག་པ་ཐོགས་ནས་སུ།
en: With garlands of flowers in our hands.

source: །སོར་བཅུ་ཐལ་མོ་སྦྱར་ཏེ་འདུད་ཅིང་ལྷགས།
en: Bearing aloft flowers as well as ointments,

source: །ལྷུག་ལྷུག་གོས་གྱོན་འཇོ་བག་གཟུགས་འཆང་བས།
en: We bowed with folded hands.

source: །ལྷ་མོ་སྒྱུ་འཕྲུལ་མལ་སྟེང་གནས་མཐོང་ནས། །ལག་པ་གཡས་པའི་སོར་མོས་ཕྱག་བྱས་ཏེ། །མི་ཡི་བུད་མེད་གཟུགས་ལ་ལེགས་ལྟོས་འཛེར།
en: “We beauties with revealing garments Stretched our hands and pointed out Queen Māyā resting in her bed, Saying, ‘Oh! Behold the beauty of that human woman!’

source: །བདག་ཅག་ང་རྒྱལ་སེམས་ཀྱིས་མངོན་སེམས་པ། །ལྷ་ཡི་བུ་མོ་གཟུགས་མཆོག་ཡིད་འོང་སྙམ།
en: “Because of pride we thought That goddesses had the most attractive bodies.

source: །རྒྱལ་པོའི་བཙུན་མོ་འདི་ཡི་གཟུགས་མཐོང་ན།
en: Yet when we saw the body of the king’s wife,

source: །ལྷ་ཡི་ལུས་ཀྱང་ཟིལ་གྱིས་ནོན་པར་མཐོང་།
en: We saw that her splendor outshines our divine bodies.

source: །འདི་ནི་གང་ཟག་མཆོག་གི་ཡུམ་འགྱུར་དུ།
en: “She will be the mother of the Supreme Being;

source: །ཡོན་ཏན་ལྡན་པས་ཤིན་ཏུ་གཤའ་ཞིང་འོས།
en: Full of charms, she is like Rati herself.

source: །ནོར་བུ་རིན་ཆེན་སྣོད་བཟང་གནས་པ་ལྟར།
en: Just as a precious jewel rests within a fine vessel,

source: །ལྷ་མོ་འདི་ནི་ལྷ་ཡི་ལྷ་སྣོད་ཡིན།
en: This queen will be such a vessel for the god of gods.

source: །རྐང་ལག་མཐིལ་དང་སྤྱི་བོ་མན་ཅད་དུ།
en: “From the palms of her hands and the soles of her feet,

source: །ཡན་ལག་ཡིད་འོང་ལྷ་ལས་ལྷག་པ་སྟེ།
en: Her attractive limbs surpass the divine.

source: །མིག་གིས་བལྟ་ན་ངོམས་པར་འགྱུར་མ་ཡིན།
en: When you look at her, your eyes will not be sated,

source: །ཡིད་དང་སེམས་ནི་ཕྱིར་ཞིང་དགའ་བར་འགྱུར།
en: And she will only thrill your heart and mind more and more.

source: །འདི་ཡི་ཁ་བཞིན་ལུས་མཛེས་སྡུག་པ་ནི། །ནམ་མཁའི་དཀྱིལ་ན་ཟླ་བ་མཛེས་པ་འདྲ། །ཉི་ལྟར་དྲི་མེད་མེ་ལྟར་འབར་བ་སྟེ།
en: “Her attractive face and body Shine like the beautiful moon in the sky And blaze like the stainless fire of the sun.

source: །འདི་ཡི་ལུས་ལས་འོད་གསལ་བཟང་པོ་འབྱུང་།
en: Her body shines with an excellent light.

source: །གསེར་སྦྲམ་བཙོ་མ་བཟང་པོའི་གསེར་བཞིན་དུ། །ལྷ་མོ་འདི་ཡི་ཁ་དོག་རྣམ་པར་མཛེས།
en: “The complexion of this queen is resplendent, Shining like the purest gold.

source: །འདི་ཡི་སྐྲ་ནི་འཇམ་གཙང་དྲི་ཞིམ་སྟེ།
en: Her hair is soft, clean, and sweetly scented,

source: །བུང་བ་མཆོག་གི་མདོག་འདྲ་ལྕང་ལོར་འཁྱིལ།
en: Black like the excellent bee and arranged in braids.

source: །འདི་ཡི་མིག་ནི་པད་མའི་འདབ་མ་འདྲ།
en: “Her eyes are like lotus petals;

source: །རྣམ་དག་སོ་ནི་ནམ་མཁའི་སྐར་མ་བཞིན།
en: Her teeth are like stars in the sky.

source: །རྐེད་པ་གཞུ་ལྟར་ཕྲ་ཞིང་སྟ་ཟུར་ཡངས།
en: Her waist is curved like a bow and her hips are ample;

source: །ཕྲག་པ་ཟླུམ་ཞིང་ཚིགས་རྣམས་མངོན་པ་མེད།
en: Her shoulders are raised and her joints are smooth.

source: །བརླ་ལེགས་གླང་པོ་མཆོག་གི་སྣ་འདྲ་སྟེ།
en: “Her thighs and calves are like the trunk of an elephant,

source: །བྱིན་པ་ཤིན་ཏུ་ལེགས་པ་བྱིན་གྱིས་ཕྲ།
en: And her knees have a shapely form.

source: །རྐང་ལག་མཐིལ་མཉམ་ཤིན་ཏུ་དམར་བ་སྟེ། །འདི་ནི་གཞན་མིན་ལྷ་ཡི་བུ་མོར་ངེས།
en: The palms of her hands and the soles of her feet are smooth and red; Surely she can only be a goddess.”

source: །དེ་ལྟར་རྣམ་མང་དུ་མར་བལྟ་བྱས་ནས།
en: Thus they examined her in many ways,

source: །མེ་ཏོག་གཏོར་ཏེ་བསྐོར་བ་བྱས་ནས་ནི།
en: Tossed flowers, and circumambulated her.

source: །གྲགས་ལྡན་རྒྱལ་བའི་ཡུམ་ལ་བསྟོད་བྱས་ཏེ།
en: Then, praising the renowned mother of the Victorious One,

source: །སྐད་ཅིག་གཅིག་གིས་ཕྱིར་ཡང་ལྷ་གནས་དོང་།
en: They instantly returned to the divine realm.

source: །དེ་ནས་ཕྱོགས་བཞི་སྐྱོང་བ་བཞི་པོ་དང་། །འཐབ་བྲལ་རབ་དང་བརྒྱ་བྱིན་འཕྲུལ་པ་དང་། །ལྷ་ཚོགས་ལྷ་མིན་གྲུལ་བུམ་སྲིན་པོ་དང་། །མིའམ་ཅི་དང་ལྟོ་འཕྱེ་ཆེས་སྨྲས་པ།
en: The four guardians of the four directions, Śakra, the gods free from strife, the gods enjoying emanations, Other gods, demigods, kumbhāṇḍas, rākṣasas, Kinnaras, and mahoragas spoke:

source: །སྐྱེས་བུ་མཆོག་གི་མདུན་དུ་ཁྱེད་དེང་ལ།
en: “Go before the Supreme Being;

source: །སྐྱེས་བུ་དམ་པ་དེ་ལ་བསྲུང་བ་གྱིས།
en: Protect him, the best of men.

source: །འགྲོ་བ་དག་ལ་ཡིད་ཀྱིས་སྡང་མ་བྱེད།
en: Do not be hostile to beings;

source: །མི་རྣམས་ལ་ཡང་གཙེ་བ་མ་བྱེད་ཅིག །
en: Do no harm to any person.”

source: ལྷ་མོ་སྒྱུ་འཕྲུལ་ཁྱིམ་མཆོག་གང་གནས་པ།
en: As Queen Māyā resided in the palace,

source: །དེར་ནི་འཐུན་པར་འཁོར་དང་ལྷན་ཅིག་ཀུན།
en: They all assembled with their retinues.

source: །མདའ་གཞུ་རལ་གྲི་མདུང་ཐུང་མཚོན་ཐོགས་ལ།
en: Holding bows and arrows, swords, spears, and weapons,

source: །ནམ་མཁའི་དཀྱིལ་ན་གནས་ཏེ་བལྟ་བར་གྱིས།
en: They remained in the middle of the sky, keeping watch.

source: །དེ་ལྟར་ཤི་འཕོའི་དུས་ཤེས་ལྷའི་བུ་རྣམས། །མེ་ཏོག་དེ་བཞིན་བྱུག་པ་ཐོགས་ནས་ནི། །སོར་བཅུ་ཐལ་མོ་སྦྱར་ཏེ་འདུད་བྱོས་ལ། །དགའ་བའི་སེམས་ཀྱིས་སྒྱུ་འཕྲུལ་དྲུང་དུ་དེང་།
en: The gods, who know the time of passing, Came joyfully before Queen Māyā. They held flowers as well as ointments; With folded hands, they paid homage.

source: །སྨྲ་བའི་སེང་གེ་དུས་ནི་དེང་ལགས་ཀྱིས།
en: “Lion of Speech, your time is now!

source: །འཇིག་རྟེན་ཀུན་ལ་ཐུགས་རྗེ་བརྩེ་བསྐྱེད་དེ།
en: Generate compassion and kindness for the entire world;

source: །མི་དབང་སེམས་ཅན་དག་པ་འཆི་འཕོ་སྟོན།
en: Lord of Men, Pure Being, demonstrate passing away.

source: །མཆོད་སྦྱིན་དོན་དུ་བདག་ཅག་གསོལ་བ་འདེབས།
en: We pray that you grant the gift of the Dharma.”

source: །དགེ་སློང་དག་དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་འཆི་འཕོ་བའི་དུས་ཀྱི་ཚེ་ཤར་ཕྱོགས་ནས་བྱང་ཆུབ་སེམས་དཔའ་སྐྱེ་བ་གཅིག་གིས་ཐོགས་པ་དགའ་ལྡན་གྱི་གནས་དམ་པ་ན་གནས་པ་བརྒྱ་སྟོང་ཕྲག་མང་པོ་དག་བྱང་ཆུབ་སེམས་དཔའ་ལ་མཆོད་པ་བྱ་བའི་ཕྱིར།
en: Monks, as the Bodhisattva was about to pass away and take rebirth, many hundreds of thousands of bodhisattvas, who were bound by just one more birth, came to him from the east of the sacred abode of the Heaven of Joy.

source: བྱང་ཆུབ་སེམས་དཔའ་ག་ལ་བ་དེར་ལྷགས་སོ།
en: They approached the Bodhisattva in order to make offerings to him.

source: །དེ་བཞིན་དུ་ཕྱོགས་བཅུའི་ཕྱོགས་རེ་རེ་ནས་ཀྱང་བྱང་ཆུབ་སེམས་དཔའ་སྐྱེ་བ་གཅིག་གིས་ཐོགས་པ། དགའ་ལྡན་གྱི་གནས་དམ་པ་ན་གནས་པ་བརྒྱ་སྟོང་ཕྲག་མང་པོ་དག་བྱང་ཆུབ་སེམས་དཔའ་ལ་མཆོད་པ་བྱ་བའི་ཕྱིར། བྱང་ཆུབ་སེམས་དཔའ་ག་ལ་བ་དེར་ལྷགས་སོ།
en: Likewise many hundreds of thousands of bodhisattvas, all of them bound by just one more birth, came from all ten directions within the sacred abode of the Heaven of Joy, also approaching the Bodhisattva in order to make offerings to him.

source: །རྒྱལ་ཆེན་བཞིའི་རིས་ཀྱི་ལྷ་རྣམས་ཀྱི་ནང་ནས་ལྷའི་བུ་མོ་འབུམ་ཕྲག་བརྒྱད་ཅུ་རྩ་བཞི་སིལ་སྙན་དང་། གླུ་དབྱངས་སྣ་ཚོགས་ལེན་ཅིང་བྱང་ཆུབ་སེམས་དཔའ་ལ་མཆོད་པ་བྱ་བའི་ཕྱིར། བྱང་ཆུབ་སེམས་དཔའ་ག་ལ་བ་དེར་ལྷགས་སོ།
en: There were eight million four hundred thousand goddesses from the Heaven of the Four Great Kings who approached the Bodhisattva, making offerings to him accompanied by music and singing.

source: །དེ་བཞིན་དུ་སུམ་ཅུ་རྩ་གསུམ་དང་། འཐབ་བྲལ་དང་། དགའ་ལྡན་དང་། འཕྲུལ་དགའ་དང་། གཞན་འཕྲུལ་དབང་བྱེད་ཀྱི་ལྷ་རྣམས་ཀྱི་ནང་ནས་ལྷའི་བུ་མོ་འབུམ་ཕྲག་བརྒྱད་ཅུ་རྩ་བཞི་སིལ་སྙན་དང་། གླུ་དབྱངས་སྣ་ཚོགས་ལེན་ཅིང་། བྱང་ཆུབ་སེམས་དཔའ་ལ་མཆོད་པ་བྱ་བའི་ཕྱིར། བྱང་ཆུབ་སེམས་དཔའ་ག་ལ་བ་དེར་ལྷགས་སོ།
en: Similarly, eight million four hundred thousand goddesses from each of the realms of the Heaven of the Thirty-Three, the Heaven Free from Strife, the Heaven of Joy, the Heaven of Delighting in Emanations, and the Heaven of Making Use of Others’ Emanations approached the Bodhisattva. Singing songs and playing musical instruments of all types, they made offerings to the Bodhisattva.

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་ཁང་པ་བརྩེགས་པ་ཆེན་པོ་བསོད་ནམས་ཐམས་ཅད་ཀྱིས་ཡང་དག་པར་བྱུང་བ་དཔལ་གྱི་སྙིང་པོ་ལྷ་རྣམས་ཀྱིས་ཀུན་ནས་བལྟ་བའི་ནང་དུ་འདུག་སྟེ།
en: At that time the Bodhisattva had taken his seat on the Glorious Essence lion throne inside his great palace. This throne had come about through all his merit and was visible to all the gods and nāgas.

source: བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་དང་། ལྷ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་ཕྲག་སྟོང་གིས་ཡོངས་སུ་བསྐོར་ཅིང་མདུན་དུ་བདར་ནས། དགའ་ལྡན་གྱི་གནས་དམ་པ་ནས་བསྐྱོད་པར་བརྩམས་སོ།
en: Then, as the bodhisattvas and many millions of gods, nāgas, and yakṣas assembled around him, he began his departure from the sublime realm of the Heaven of Joy.

source: །དགེ་སློང་དག་དེ་ལྟར་བསྐྱོད་པར་བརྩམས་པའི་ཚེ་བྱང་ཆུབ་སེམས་དཔས་འོད་གང་གིས་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་ལྟར་རྒྱ་ཆེ་ཞིང་ཡངས་ལ་ཐ་གྲུ་ཆེ་བ་འདིར་སྔན་ཅད་མ་བྱུང་བའི་འོད་སྣང་བ་ལྷའི་འོད་ལས་ཤིན་ཏུ་འདས་པས་ཡོངས་སུ་གསལ་ཞིང་སྣང་བར་གྱུར་ཏོ།
en: Monks, as he started to move, the Bodhisattva’s body began to shine with a brilliant and dazzling light that surpassed any other celestial light. This unprecedented light illuminated all the vast and enormous realms of the great trichiliocosm.

source: །འཇིག་རྟེན་གྱི་བར་གང་སྡིག་པ་སྡིག་པས་ཁེབས་ནས་མུན་པ་མུན་ནག་སྨག་ཏུ་གྱུར་པ་སྣང་བ་མེད་པ་གང་དུ་ཉི་མ་དང་ཟླ་བ་འདི་གཉིས་འདི་ལྟར་རྫུ་འཕྲུལ་ཆེ་ཞིང་འདི་ལྟར་མཐུ་ཆེ་ལ་འདི་ལྟར་དབང་ཆེ་བར་གྲགས་པས་ཀྱང་འོད་དང་། ཁ་དོག་དང་། གཟི་བརྗིད་ཀྱིས་ལམ་མེར་མ་གྱུར། ཐལ་ལེར་མ་གྱུར།
en: Even the darkest regions of the world, filled with negativity and obscurity, where even the renowned great power and magical ability of the sun and the moon are unable to produce light, colors, or heat, were bathed in light.

source: ལྷང་ངེར་མ་གྱུར་པ་དེར་སེམས་ཅན་གང་དག་སྐྱེས་པ་དེ་དག་རང་རང་གིས་ལག་པ་བརྐྱང་བའང་མི་མཐོང་བ་དེ་དག་ཏུའང་དེའི་ཚེ་སྣང་བ་ཆེན་པོས་རྒྱས་པར་ཁྱབ་པར་གྱུར་ཅིང་།
en: In those realms, the unfortunate beings normally cannot even see their own hands. But even there, the dazzling light shone.

source: དེར་སྐྱེས་པའི་སེམས་ཅན་དེ་དག་སྣང་བ་དེས་ཁྱབ་པར་གྱུར་ནས་གཅིག་གིས་གཅིག་མཐོང་ཞིང་གཅིག་གིས་གཅིག་ཤེས་ཏེ། འདི་སྐད་དུ་ཀྱེ་གྲོགས་པོ་དག་སེམས་ཅན་གཞན་དག་ཀྱང་འདིར་སྐྱེས་སོ།
en: Due to the light, the beings in those realms now recognized one another and remarked, “Listen, friends!

source: །ཀྱེ་གྲོགས་པོ་དག་སེམས་ཅན་གཞན་དག་ཀྱང་འདིར་སྐྱེས་སོ་ཞེས་ཟེར་བར་གྱུར་པ་དེ་ལྟ་བུའི་འོད་ལུས་ལས་བཀྱེའོ།
en: Other beings have also been born here!”

source: །སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདིའང་རྣམ་པ་དྲུག་དང་། ལྟས་ཆེན་པོ་བཅྭ་བརྒྱད་དུ་གཡོས། རབ་ཏུ་གཡོས། ཀུན་ཏུ་རབ་ཏུ་གཡོས་སོ། །འགུལ་རབ་ཏུ་འགུལ། ཀུན་ཏུ་རབ་ཏུ་འགུལ་ཏོ། །ལྡེག་རབ་ཏུ་ལྡེག །ཀུན་ཏུ་རབ་ཏུ་ལྡེག་གོ།
en: Then the whole billionfold world system shook in six ways and exhibited eighteen great signs.

source: །འཁྲུགས་རབ་ཏུ་འཁྲུགས། ཀུན་ཏུ་རབ་ཏུ་འཁྲུགས་སོ། །འུར་འུར་རབ་ཏུ་འུར་འུར། ཀུན་ཏུ་རབ་ཏུ་འུར་འུར་རོ། །
en: It began to quiver, tremble, quake, move, make sound, and roar, each in three degrees of intensity.

source: ཆེམ་ཆེམ་རབ་ཏུ་ཆེམ་ཆེམ། ཀུན་ཏུ་རབ་ཏུ་ཆེམ་ཆེམ་མོ། ། མཐའ་དམའ་ན་དབུས་མཐོ་བར་གྱུར་ཏོ། །དབུས་དམའ་ན་མཐའ་མཐོ་བར་གྱུར་ཏོ། །ཤར་ཕྱོགས་དམའ་ན་ནུབ་ཕྱོགས་མཐོ་བར་གྱུར་ཏོ། །ནུབ་ཕྱོགས་དམའ་ན་ཤར་ཕྱོགས་མཐོ་བར་གྱུར་ཏོ། །ལྷོ་ཕྱོགས་དམའ་ན་བྱང་ཕྱོགས་མཐོ་བར་གྱུར་ཏོ། །བྱང་ཕྱོགས་དམའ་ན་ལྷོ་ཕྱོགས་མཐོ་བར་གྱུར་ཏོ།
en: The world shook so violently that its center and edge, east and west, as well as north and south, all bounced around, so that when one side was up, the other was down.

source: །དེའི་ཚེ་སྒྲ་དགའ་བར་འགྱུར་བ། ཚིམ་པར་འགྱུར་བ། མགུ་བར་འགྱུར་བ། དད་པར་འགྱུར་བ། སིམ་པར་འགྱུར་བ། མཉན་པར་འོས་པ།
en: At that point one could hear all sorts of pleasant and cheerful sounds. There were sounds that inspired love and made everyone serene.

source: བསྔགས་པར་འོས་པ། མཚུངས་པ་མེད་པ། མཉན་ན་གཏང་མི་བྲ་བ། མི་འཐུན་པ་མེད་པ། དངང་བར་འགྱུར་བ་མེད་པ་དག་ཀྱང་གྲག་པར་གྱུར་ཏོ།
en: There were inviting and refreshing sounds that were impossible to describe or imitate, agreeable sounds that do not produce fear.

source: །སྐད་ཅིག་དེ་ལ་སེམས་ཅན་གང་ལ་ཡང་གནོད་པའམ། འཇིགས་པའམ། དངང་བའམ། བག་ནོན་པ་མེད་པར་གྱུར་ཏོ།
en: At that moment there was not a single being anywhere that felt hostile, frightened, or anxious.

source: །སྐད་ཅིག་དེ་ལ་ཉི་ཟླ་དང་། བརྒྱ་བྱིན་དང་། ཚངས་པ་དང་། འཇིག་རྟེན་སྐྱོང་བ་དག་གི་འོད་ཀྱང་མི་སྣང་བར་གྱུར་ཏོ།
en: At that moment even the light of the sun and moon and the splendor of the gods, such as Śakra, Brahmā, and the world protectors, was eclipsed.

source: །སེམས་ཅན་དམྱལ་བ་དང་། དུད་འགྲོའི་སྐྱེ་གནས་དང་། གཤིན་རྗེའི་འཇིག་རྟེན་དུ་སྐྱེས་པའི་སེམས་ཅན་ཐམས་ཅད་ཀྱང་སྐད་ཅིག་དེ་ལ་སྡུག་བསྔལ་དང་བྲལ་ཞིང་བདེ་བ་ཐམས་ཅད་དང་ལྡན་པར་གྱུར་ཏེ།
en: All beings who were living in the hells, along with those born as animals and all those in the realm of the lord of death, became instantaneously free from suffering and filled with every happiness.

source: སེམས་ཅན་གང་ལ་ཡང་འདོད་ཆགས་ཀྱིས་གནོད་པར་མི་འགྱུར། ཞེ་སྡང་གིས་གནོད་པར་མི་འགྱུར། གཏི་མུག་གིས་གནོད་པར་མི་འགྱུར་ཞིང་། ཕྲག་དོག་གམ། སེར་སྣའམ། ང་རྒྱལ་ལམ། འཆབ་པའམ། རྒྱགས་པའམ། ཁྲོ་བའམ། གནོད་སེམས་སམ། ཡོངས་སུ་གདུང་བས་གནོད་པར་འགྱུར་བ་མེད་པར་གྱུར་ཏེ།
en: No being had any painful emotion, such as anger, delusion, envy, jealousy, pride, hypocrisy, arrogance, wrath, malice, or burning anguish.

source: སེམས་ཅན་ཐམས་ཅད་ཀྱང་སྐད་ཅིག་དེ་ལ། ཕན་ཚུན་ཕ་མ་ཙམ་དུ་སེམས་པའི་འདུ་ཤེས་སུ་གྱུར་ནས། བྱམས་པའི་སེམས་དང་། ཕན་པའི་སེམས་དང་ལྡན་པར་གྱུར་ཏོ།
en: At that moment all sentient beings felt love for each other, wished each other well, and saw each other as parents and children.

source: །ལྷ་དང་མིའི་རོལ་མོ་སིལ་སྙན་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་དག་ཀྱང་མ་དཀྲོལ་མ་བླངས་པར་ཡིད་དུ་འོང་བའི་སྒྲ་འབྱིན་པར་གྱུར་ཏོ།
en: Trillions of divine and human musical instruments played sweet sounds without even being touched or played.

source: །ལྷ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་དག་ཀྱང་ལག་པ་དང་ཕྲག་པ་དང་སྤྱི་བོས་གཞལ་མེད་ཁང་ཆེན་པོ་དེ་དག་འདེག་ཅིང་ཁྱེར་བར་གྱུར་ཏོ།
en: Hundreds of millions of gods lifted and carried that great mansion using their hands, shoulders, and the crowns of their heads.

source: །ལྷའི་བུ་མོ་བརྒྱ་སྟོང་དག་གིས་ཀྱང་རང་རང་གི་གླུ་དབྱངས་བླངས་ཏེ།
en: Hundreds of thousands of goddesses each sang songs.

source: མདུན་དང་། རྒྱབ་དང་། གཡས་གཡོན་དག་ནས་བྱང་ཆུབ་སེམས་དཔའ་ལ་གླུ་དབྱངས་ཀྱི་སྒྲ་སྐད་ཀྱིས་མངོན་པར་བསྟོད་པ།
en: From all around they praised the Bodhisattva with the sounds of their tunes:

source: ཁྱོད་ཀྱིས་སྔན་ཆད་དགེ་ལས་བསགས་པ་དང་། །ཡུན་རིང་དུས་ཀྱི་དགེ་བས་བྱུང་བ་དང་། །ཁྱོད་ཀྱིས་ཆོས་རྣམས་ཀུན་གྱི་ཚུལ་སྦྱངས་པས།
en: “You previously accumulated virtuous actions; You have appeared through virtue gathered over a long time. You have purified the mode of all phenomena;

source: །དེ་རིང་མཆོད་པ་རྒྱ་ཆེན་བྱུང་བར་གྱུར།
en: Today we bring forth a great offering to you.

source: །བསྐལ་པ་བྱེ་བ་མང་པོར་ཁྱོད་ཀྱིས་སྔོན།
en: “In the past, for billions of eons,

source: །སྲས་མོ་སྲས་སྡུག་སྦྱིན་པ་མཛད་པས་ན།
en: You gave up your dear sons and daughters.

source: །ལྷ་ཡི་མེ་ཏོག་ཆར་དུ་བབ་པ་འདི།
en: This shower of celestial flowers

source: །སྦྱིན་པ་སྤྱད་པ་དེ་ཡི་འབྲས་བུ་ལགས།
en: Is the fruition of that generosity.

source: །གཙོ་བོ་ཁྱོད་ཀྱིས་རང་གི་ཤ་བཅད་དེ།
en: “Lord, you cut off your own flesh,

source: །སྲང་ལ་བཅལ་ནས་ཐུགས་བྱོན་བྱ་ཕྱིར་བཏང་།
en: Kindheartedly exchanging it to release a bird.

source: །སྦྱིན་པ་དེ་སྤྱད་པ་ཡི་འབྲས་བུ་དེས།
en: The fruition of that practice of giving

source: །ཡི་དགས་འཇིག་རྟེན་རྣམས་ཀྱང་ཟས་སྐོམ་ཐོབ།
en: Is that those in the world of pretas obtain food and drink.

source: །ཚུལ་ཁྲིམས་མ་ཞིག་མ་ཉམས་བསྲུངས་པས་ན།
en: You preserved unbroken, uncorrupted discipline.

source: །ཚུལ་ཁྲིམས་དེ་སྤྱད་པ་ཡི་འབྲས་བུ་དེས།
en: By the fruition of the practice of that discipline,

source: །མི་ཁོམ་ངན་སོང་ཡོངས་སུ་དག་པར་གྱུར།
en: Those in the lower realms without all the freedoms are purified.

source: །བྱང་ཆུབ་བསྒྲུབ་པའི་གཞིར་ནི་བཟོད་པ་བསྒོམས།
en: You cultivated patience as the basis for attaining awakening.

source: །བཟོད་པ་དེ་སྤྱད་པ་ཡི་འབྲས་བུ་དེས།
en: The result of your practice of patience

source: །ལྷ་དང་མི་ཀུན་བྱམས་པའི་སེམས་སུ་གྱུར།
en: Is that gods and humans develop loving minds.

source: །བརྩོན་འགྲུས་མ་གོད་དམ་པ་བསྒོམས་པས་ན།
en: You cultivated supreme and unwavering diligence.

source: །བརྩོན་འགྲུས་དེ་སྤྱད་པ་ཡི་འབྲས་བུ་དེས།
en: The result of your practice of diligence
